Repository: stevensdotb/virusscan-ai-bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: es

# BOT_WELCOME_MESSAGE
source: 👋 Hi, {user.first_name}! 🤖 I'm {config.BOT_NAME} Bot
es: 👋 Hola, {user.first_name}! 🤖 Soy VScanAI, tu asistente para analizar archivos y URLs en busca de amenazas potenciales.

# BOT_REQUEST_FILE_OR_URL
source: 🧐 Send me a file or URL. Large files may take longer to process
es: 🧐 ¿Te gustaría escanear un archivo o URL ahora? Los archivos grandes pueden tardar más en procesarse.

# BOT_ERROR_INVALID_URL
source: ❌ Invalid URL. Please make sure the URL includes (http:// or https://), i.e https://google.com
es: ❌ URL no válida. Por favor, asegúrate de que la URL incluya (http:// o https://). Por ejemplo, https://google.com

# BOT_PUBLIC_IP
source: Your Public IP is: {ip}
es: Tu IP pública es: {ip}

# BOT_ERROR_IP_RETRIEVAL
source: ❌ Error retrieving public IP. Please try again later.
es: ❌ Error obteniendo IP pública. Por favor, inténtalo de nuevo más tarde.

# BOT_ERROR_URL_ANALYSIS
source: ❌ Sorry, there was an error analyzing the URL.
es: ❌ Lo siento, hubo un error al analizar la URL.

# BOT_STATUS_ANALYZING_URL
source: ⏳ Analyzing URL...
es: ⏳ Analizando URL...

# BOT_BUTTON_CHECK_IP
source: What's my IP?
es: ¿Cuál es mi IP?

# BOT_ERROR_FILE_TOO_LARGE
source: ❌ File too large. Please send files smaller than 5MB.
es: ❌ El archivo es demasiado grande. Por favor, envíe archivos menores a 5MB.

# BOT_STATUS_ANALYZING_FILE
source: ⏳ Analyzing file...
es: ⏳ Analizando archivo...

# BOT_FILE_STATUS_SAFE
source: ✅ FILE SAFE
es: ✅ ARCHIVO SEGURO

# BOT_FILE_STATUS_DANGEROUS
source: ❌ FILE POTENTIALLY DANGEROUS
es: ❌ ARCHIVO POTENCIALMENTE PELIGROSO

# BOT_FILE_STATUS_SUSPICIOUS
source: ⚠️ FILE SUSPICIOUS
es: ⚠️ ARCHIVO SOSPECHOSO

# BOT_FILE_SUSPICIOUS_WARNING
source: If you're not sure about the content of this file, it's better not to open it. Otherwise, open it with caution.
es: Si no estás seguro del contenido de este archivo es mejor no abrirlo, de lo contrario hazlo con precaución.

# BOT_ERROR_FILE_ANALYSIS
source: ☠️ Sorry, an error occurred while analyzing the file.
es: ☠️ Lo siento, ha ocurrido un error al analizar el archivo.

# BOT_FILE_TYPE
source: File type: {file_type}
es: Tipo de archivo: {file_type}

# BOT_FILE_SIZE
source: Size: {vt_result['file_size'] / 1024:.2f} KB
es: Tamaño: {vt_result['file_size'] / 1024:.2f} KB

# BOT_DETECTION_RESULTS
source: Detection results:
es: Resultados detallados:

# BOT_NO_THREATS
source: No known threats detected.
es: No se detectaron amenazas conocidas.
